IMPORTING PANDAS

In [1]:
#this code is to import pandas
import pandas as pd

In [2]:
pd.DataFrame({'Yes':[50, 21], 'No':[131, 21]})

   Yes   No
0   50  131
1   21   21

In [3]:
Dataset = pd.read_csv("Data.csv")

In [4]:
Dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [5]:
Dataset['Country']

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [6]:
Dataset['Country'] [0]

'France'

In [7]:
Dataset['Country'] [1]

'Spain'

In [8]:
Dataset['Country'] [2:8]

2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
Name: Country, dtype: object

In [9]:
Dataset.Country == 'Germany'

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8     True
9    False
Name: Country, dtype: bool

In [10]:
Dataset.loc[Dataset.Country=='Germany']

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [11]:
Germany_Column=Dataset.loc[Dataset.Country=='Germany']

In [12]:
Germany_Column

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [13]:
Germany_Column. to_csv('germanyData.csv')

In [15]:
Dataset.loc[Dataset.Salary.isnull()]

   Country   Age  Salary Purchased
4  Germany  40.0     NaN       Yes

In [16]:
Dataset.loc[Dataset.Salary.notnull()]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [19]:
Dataset['Salary'] = 10000

In [20]:
Dataset

   Country   Age  Salary Purchased
0   France  44.0   10000        No
1    Spain  27.0   10000       Yes
2  Germany  30.0   10000        No
3    Spain  38.0   10000        No
4  Germany  40.0   10000       Yes
5   France  35.0   10000       Yes
6    Spain   NaN   10000        No
7   France  48.0   10000       Yes
8  Germany  50.0   10000        No
9   France  37.0   10000       Yes

In [21]:
Dataset.loc[2,'salary'] = 25000

In [22]:
Dataset

   Country   Age  Salary Purchased   salary
0   France  44.0   10000        No      NaN
1    Spain  27.0   10000       Yes      NaN
2  Germany  30.0   10000        No  25000.0
3    Spain  38.0   10000        No      NaN
4  Germany  40.0   10000       Yes      NaN
5   France  35.0   10000       Yes      NaN
6    Spain   NaN   10000        No      NaN
7   France  48.0   10000       Yes      NaN
8  Germany  50.0   10000        No      NaN
9   France  37.0   10000       Yes      NaN